# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD04MGJmZjNlNi0xNmM0LTQ4MzktOWNlOC02MGMxYTgzMWNlNTI7b2JqZWN0SWQ9YjU5YWI3YjktZGIzOC00YmQzLTg2MTQtZTZkMTBhZDcwYjExO3N1YnNjcmlwdGlvbklkPTdiNmY4ZjE1LTNhM2UtNDNhMi1iNmFjLThlYjZjMDZhZDEwMzt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault_secret.admin_conn_string will be created
  + resource "azurerm_key_vault_secret" "admin_conn_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.KeyVault/vaults/oed-kv"
      + name                    = "dd-pgadmin-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.user_conn_string will be created
  + resource "azurerm_key_vault_secret" "user_conn_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.KeyVault/vaults/oed-kv"
      + name                    = "dd-pguser-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_postgresql_flexible_server.pg will be created
  + resource "azurerm_postgresql_flexible_server" "pg" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "dd-test-pg"
      + private_dns_zone_id           = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "altinn-digdir-oed-tt02-rg"
      + sku_name                      = "B_Standard_B1ms"
      + storage_mb                    = 32768
      + storage_tier                  = (known after apply)
      + version                       = "16"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
        }

      + high_availability {
          + mode = "SameZone"
        }
    }

  # azurerm_postgresql_flexible_server_database.db will be created
  + resource "azurerm_postgresql_flexible_server_database" "db" {
      + charset   = "UTF8"
      + collation = "en_US.utf8"
      + id        = (known after apply)
      + name      = "dd-test-pg-db"
      + server_id = (known after apply)
    }

  # azurerm_windows_function_app.feedpoller will be updated in-place
  ~ resource "azurerm_windows_function_app" "feedpoller" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Web/sites/oed-test-feedpoller-func"
        name                                           = "oed-test-feedpoller-func"
        tags                                           = {
            "costcenter"                                     = "altinn3"
            "hidden-link: /app-insights-conn-string"         = (sensitive value)
            "hidden-link: /app-insights-instrumentation-key" = (sensitive value)
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/7b6f8f15-3a3e-43a2-b6ac-8eb6c06ad103/resourceGroups/altinn-digdir-oed-tt02-rg/providers/Microsoft.Insights/components/oed-test-feedpoller-ai"
            "solution"                                       = "apps"
        }
        # (33 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # null_resource.execute_az_cli will be created
  + resource "null_resource" "execute_az_cli" {
      + id = (known after apply)
    }

  # random_password.dd_admin_password will be created
  + resource "random_password" "dd_admin_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.dd_user_password will be created
  + resource "random_password" "dd_user_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 7 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @kurt70 |
| Action | `push` |
| Working Directory | `./infra/altinn-digdir-oed-tt02-rg` |
| State File | `github.com/altinn/dd-infrastructure/environments/test/altinn-digdir-oed-tt02-rg.tfstate` |
| Plan File | `github.com_altinn_dd-infrastructure_environments_test_altinn-digdir-oed-tt02-rg.tfstate.tfplan`